app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG')  ORDER BY release_date
---
    def index
      @sort = params[:sort]||session[:sort]
      @all_ratings = Movie.ratings
      @ratings =  params[:ratings] || session[:ratings] || Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "zohreh"], ["rating", "G"], ["release_date", "2022-02-26 00:00:00.000000"], ["created_at", "2022-02-26 23:28:09.409269"], ["updated_at", "2022-02-26 23:28:09.409269"]]
---
    def create
      @movie = Movie.create!(movie_params)